tiborsimon/embedded-tdd-headers/pic/8bit/pic18f26k22_tdd.h
#define TMR3CS0                       1091
#define TMR3CS                        1092
#define TMR3CS1                       1093
#define RD163                         1094
#define TMR3L                         1095
#define TMR3H                         1096
#define T3GCON                        1097
#define T3GSS0                        1098
#define T3GSS                         1099
#define T3GSS1                        1100
#define T3GVAL                        1101
#define T3GGO                         1102
#define T3GGO_NOT_DONE                1103
#define T3G_DONE                      1104
#define T3GGO_nDONE                   1105
#define T3GSPM                        1106
#define T3GTM                         1107
#define T3GPOL                        1108
#define TMR3GE                        1109
#define ECCP1AS                       1110
#define P1SSBD0                       1111
#define PSS1BD                        1112
#define P1SSBD                        1113
#define PSSBD                         1114
#define PSSBD0                        1115
#define PSS1BD0                       1116
#define P1SSBD1                       1117
#define PSSBD1                        1118
#define PSS1BD1                       1119
#define P1SSAC0                       1120
#define PSSAC                         1121
#define PSS1AC                        1122
#define PSSAC0                        1123
#define PSS1AC0                       1124
#define P1SSAC                        1125
#define P1SSAC1                       1126
#define PSSAC1                        1127
#define PSS1AC1                       1128
#define CCP1AS0                       1129
#define CCP1AS                        1130
#define ECCPAS                        1131
#define ECCPAS0                       1132
#define CCP1AS1                       1133
#define ECCPAS1                       1134
#define CCP1AS2                       1135
#define ECCPAS2                       1136
#define ECCPASE                       1137
#define CCP1ASE                       1138
#define PWM1CON                       1139
#define PDC0                          1140
#define P1DC                          1141
#define P1DC0                         1142
#define PDC                           1143
#define PDC1                          1144
#define P1DC1                         1145
#define PDC2                          1146
#define P1DC2                         1147
#define PDC3                          1148
#define P1DC3                         1149
#define PDC4                          1150
#define P1DC4                         1151
#define PDC5                          1152
#define P1DC5                         1153
#define P1DC6                         1154
#define PDC6                          1155
#define PRSEN                         1156
#define P1RSEN                        1157
#define BAUDCON1                      1158
#define BAUDCON1_ABDEN                1159
#define ABDEN1                        1160
#define BAUDCON1_WUE                  1161
#define WUE1                          1162
#define W4E                           1163
#define BRG161                        1164
#define BAUDCON1_BRG16                1165
#define BAUDCON1_CKTXP                1166
#define SCKP1                         1167
#define TXCKP                         1168
#define BAUDCON1_SCKP                 1169
#define TXCKP1                        1170
#define DTRXP1                        1171
#define RXDTP1                        1172
#define RXCKP                         1173
#define BAUDCON1_DTRXP                1174
#define RXDTP                         1175
#define RCMT1                         1176
#define RCIDL1                        1177
#define BAUDCON1_RCIDL                1178
#define RCMT                          1179
#define ABDOVF1                       1180
#define BAUDCON1_ABDOVF               1181
#define PSTR1CON                      1182
#define STR1A                         1183
#define STRA                          1184
#define STR1B                         1185
#define STRB                          1186
#define STR1C                         1187
#define STRC                          1188
#define STR1D                         1189
#define STRD                          1190
#define STR1SYNC                      1191
#define STRSYNC                       1192
#define T2CON                         1193
#define T2CKPS0                       1194
#define T2CKPS                        1195
#define T2CKPS1                       1196
#define TMR2ON                        1197
#define T2OUTPS0                      1198
#define T2OUTPS                       1199
#define T2OUTPS1                      1200
#define T2OUTPS2                      1201
#define T2OUTPS3                      1202
#define PR2                           1203
#define TMR2                          1204
#define CCP1CON                       1205
#define CCP1M0                        1206
#define CCP1M                         1207
#define CCP1M1                        1208
#define CCP1M2                        1209
#define CCP1M3                        1210
#define DC1B                          1211
#define DC1B0                         1212
#define DC1B1                         1213
#define P1M                           1214
#define P1M0                          1215
#define P1M1                          1216
#define CCPR1L                        1217
#define CCPR1H                        1218
#define ADCON2                        1219
#define ADCS0                         1220
#define ADCS                          1221
#define ADCS1                         1222
#define ADCS2                         1223
#define ACQT0                         1224
#define ACQT                          1225
#define ACQT1                         1226
#define ACQT2                         1227
#define ADFM                          1228
#define ADCON1                        1229
#define NVCFG                         1230
#define NVCFG0                        1231
#define NVCFG1                        1232
#define PVCFG                         1233
#define PVCFG0                        1234
#define CHSN3                         1235
#define PVCFG1                        1236
#define TRIGSEL                       1237
#define ADCON0                        1238
#define ADON                          1239
#define nDONE                         1240
#define GO_nDONE                      1241
#define NOT_DONE                      1242
#define GODONE                        1243
#define GO_DONE                       1244
#define DONE                          1245
#define GO_NOT_DONE                   1246
#define GO                            1247
#define CHS                           1248
#define CHS0                          1249
#define CHS1                          1250
#define CHS2                          1251
#define CHS3                          1252
#define CHS4                          1253
#define ADRESL                        1254
#define ADRESH                        1255
#define SSP1CON2                      1256
#define SEN1                          1257
#define SSP1CON2_SEN                  1258
#define ADMSK11                       1259
#define SSP1CON2_RSEN                 1260
#define RSEN1                         1261
#define ADMSK1                        1262
#define SSP1CON2_PEN                  1263
#define ADMSK21                       1264
#define PEN1                          1265
#define ADMSK2                        1266
#define ADMSK31                       1267
#define RCEN1                         1268
#define SSP1CON2_RCEN                 1269
#define ADMSK3                        1270
#define SSP1CON2_ACKEN                1271
#define ACKEN1                        1272
#define ADMSK41                       1273
#define ADMSK4                        1274
#define ACKDT1                        1275
#define ADMSK51                       1276
#define SSP1CON2_ACKDT                1277
#define ADMSK5                        1278
#define SSP1CON2_ACKSTAT              1279
#define ACKSTAT1                      1280
#define GCEN1                         1281
#define SSP1CON2_GCEN                 1282
#define SSP1CON1                      1283
#define SSP1CON1_SSPM0                1284
#define SSPM01                        1285
#define SSP1CON1_SSPM                 1286
#define SSP1CON1_SSPM1                1287
#define SSPM11                        1288
#define SSP1CON1_SSPM2                1289
#define SSPM21                        1290
#define SSPM31                        1291
#define SSP1CON1_SSPM3                1292
#define SSP1CON1_CKP                  1293
#define CKP1                          1294
#define SSPEN1                        1295
#define SSP1CON1_SSPEN                1296
#define SSPOV1                        1297
#define SSP1CON1_SSPOV                1298
#define WCOL1                         1299
#define SSP1CON1_WCOL                 1300
#define SSP1STAT                      1301
#define BF1                           1302
#define SSP1STAT_BF                   1303
#define UA1                           1304
#define SSP1STAT_UA                   1305
#define SSP1STAT_R_NOT_W              1306
#define READ_WRITE                    1307
#define RW1                           1308
#define NOT_W                         1309
#define SSP1STAT_W                    1310
#define I2C_READ                      1311
#define SSP1STAT_R                    1312
#define SSP1STAT_nW                   1313
#define RW                            1314
#define SSP1STAT_NOT_WRITE            1315
#define SSP1STAT_nWRITE               1316
#define SSP1STAT_R_W                  1317
#define SSP1STAT_R_nW                 1318
#define SSP1STAT_S                    1319
#define START                         1320
#define START1                        1321
#define I2C_START                     1322
#define STOP                          1323
#define SSP1STAT_P                    1324
#define STOP1                         1325
#define I2C_STOP                      1326
#define SSP1STAT_D                    1327
#define SSP1STAT_D_NOT_A              1328
#define NOT_A                         1329
#define SSP1STAT_D_A                  1330
#define SSP1STAT_D_nA                 1331
#define SSP1STAT_NOT_ADDRESS          1332
#define SSP1STAT_nA                   1333
#define SSP1STAT_A                    1334
#define DA1                           1335
#define DA                            1336
#define DATA_ADDRESS                  1337
#define SSP1STAT_nADDRESS             1338
#define I2C_DAT                       1339
#define SSP1STAT_CKE                  1340
#define CKE1                          1341
#define SSP1STAT_SMP                  1342
#define SMP1                          1343
#define SSP1ADD_SSPADD                1344
#define SSP1ADD_MSK0                  1345
#define MSK01                         1346
#define SSP1ADD                       1347
#define SSP1ADD_MSK1                  1348
#define MSK11                         1349
#define SSP1ADD_MSK2                  1350
#define MSK21                         1351
#define MSK31                         1352
#define SSP1ADD_MSK3                  1353
#define SSP1ADD_MSK4                  1354
#define MSK41                         1355
#define MSK51                         1356
#define SSP1ADD_MSK5                  1357
#define MSK61                         1358
#define SSP1ADD_MSK6                  1359
#define SSP1ADD_MSK7                  1360
#define MSK71                         1361
#define SSP1BUF_SSPBUF                1362
#define SSP1BUF                       1363
#define SSP1MSK                       1364
#define SSP1MSK_MSK0                  1365
#define SSP1MSK_MSK1                  1366
#define SSP1MSK_MSK2                  1367
#define SSP1MSK_MSK3                  1368
#define SSP1MSK_MSK4                  1369
#define SSP1MSK_MSK5                  1370
#define SSP1MSK_MSK6                  1371
#define SSP1MSK_MSK7                  1372
#define SSP1CON3                      1373
#define SSP1CON3_DHEN                 1374
#define SSP1CON3_AHEN                 1375
#define SSP1CON3_SBCDE                1376
#define SSP1CON3_SDAHT                1377
#define SSP1CON3_BOEN                 1378
#define SSP1CON3_SCIE                 1379
#define SSP1CON3_PCIE                 1380
#define SSP1CON3_ACKTIM               1381
#define T1GCON                        1382
#define T1GSS0                        1383
#define T1GSS                         1384
#define T1GSS1                        1385
#define T1GVAL                        1386
#define T1GGO_NOT_DONE                1387
#define T1GGO_nDONE                   1388
#define T1G_DONE                      1389
#define T1GGO                         1390
#define T1GSPM                        1391
#define T1GTM                         1392
#define T1GPOL                        1393
#define TMR1GE                        1394
#define T1CON                         1395
#define TMR1ON                        1396
#define RD16                          1397
#define T1RD16                        1398
#define NOT_T1SYNC                    1399
#define T1SYNC                        1400
#define nT1SYNC                       1401
#define T1SOSCEN                      1402
#define T1OSCEN                       1403
#define SOSCEN                        1404
#define T1CKPS0                       1405
#define T1CKPS                        1406
#define T1CKPS1                       1407
#define TMR1CS0                       1408
#define TMR1CS                        1409
#define TMR1CS1                       1410
#define TMR1L                         1411
#define TMR1H                         1412
#define RCON                          1413
#define BOR                           1414
#define NOT_BOR                       1415
#define nBOR                          1416
#define POR                           1417
#define nPOR                          1418
#define NOT_POR                       1419
#define PD                            1420
#define nPD                           1421
#define NOT_PD                        1422
#define NOT_TO                        1423
#define nTO                           1424
#define TO                            1425
#define nRI                           1426
#define NOT_RI                        1427
#define RI                            1428
#define SBOREN                        1429
#define IPEN                          1430
#define WDTCON                        1431
#define SWDTE                         1432
#define SWDTEN                        1433
#define OSCCON2                       1434
#define LFIOFS                        1435
#define MFIOFS                        1436
#define PRISD                         1437
#define SOSCGO                        1438
#define MFIOSEL                       1439
#define SOSCRUN                       1440
#define PLLRDY                        1441
#define OSCCON                        1442
#define SCS0                          1443
#define SCS                           1444
#define SCS1                          1445
#define IOFS                          1446
#define HFIOFS                        1447
#define OSTS                          1448
#define IRCF                          1449
#define IRCF0                         1450
#define IRCF1                         1451
#define IRCF2                         1452
#define IDLEN                         1453
#define T0CON                         1454
#define T0PS                          1455
#define T0PS0                         1456
#define T0PS1                         1457
#define T0PS2                         1458
#define PSA                           1459
#define T0SE                          1460
#define T0CS                          1461
#define T08BIT                        1462
#define TMR0ON                        1463
#define TMR0L                         1464
#define TMR0H                         1465
#define STATUS                        1466
#define C                             1467
#define CARRY                         1468
#define DC                            1469
#define ZERO                          1470
#define Z                             1471
#define OV                            1472
#define OVERFLOW                      1473
#define N                             1474
#define NEGATIVE                      1475
#define FSR2L                         1476
#define PLUSW2                        1477
#define PREINC2                       1478
#define POSTDEC2                      1479
#define POSTINC2                      1480
#define INDF2                         1481
#define FSR1L                         1482
#define PLUSW1                        1483
#define PREINC1                       1484
#define POSTDEC1                      1485
#define POSTINC1                      1486
#define INDF1                         1487
#define WREG                          1488
#define FSR0L                         1489
#define PLUSW0                        1490
#define PREINC0                       1491
#define POSTDEC0                      1492
#define POSTINC0                      1493
#define INDF0                         1494
#define INTCON3                       1495
#define INT1IF                        1496
#define INT1F                         1497
#define INT2IF                        1498
#define INT2F                         1499
#define INT1E                         1500
#define INT1IE                        1501
#define INT2IE                        1502
#define INT2E                         1503
#define INT1P                         1504
#define INT1IP                        1505
#define INT2IP                        1506
#define INT2P                         1507
#define INTCON2                       1508
#define RBIP                          1509
#define TMR0IP                        1510
#define INTEDG2                       1511
#define INTEDG1                       1512
#define INTEDG0                       1513
#define RBPU                          1514
#define NOT_RBPU                      1515
#define nRBPU                         1516
#define INTCON                        1517
#define RBIF                          1518
#define INT0F                         1519
#define INT0IF                        1520
#define T0IF                          1521
#define TMR0IF                        1522
#define RBIE                          1523
#define INT0E                         1524
#define INT0IE                        1525
#define T0IE                          1526
#define TMR0IE                        1527
#define PEIE                          1528
#define PEIE_GIEL                     1529
#define GIEL                          1530
#define GIE_GIEH                      1531
#define GIE                           1532
#define GIEH                          1533
#define PRODL                         1534
#define PRODH                         1535
#define TABLAT                        1536
#define TBLPTRL                       1537
#define TBLPTRH                       1538
#define TBLPTRU                       1539
#define ACSS                          1540
#define PCL                           1541
#define PCLATH                        1542
#define PCH                           1543
#define STKPTR0                       1544
#define STKPTR                        1545
#define SP0                           1546
#define STKPTR1                       1547
#define SP1                           1548
#define STKPTR2                       1549
#define SP2                           1550
#define SP3                           1551
#define STKPTR3                       1552
#define STKPTR4                       1553
#define SP4                           1554
#define STKUNF                        1555
#define STKOVF                        1556
#define STKFUL                        1557
#define TOSL                          1558
#define TOSH                          1559

#endif // _PIC18F26K22_H_
